# მომხმარებელს შემოატანინეთ ასაკი და ამის მიხედვით დაბეჭდეთ ეს:
#  თუ ასაკი არის 0-12 მაშინ დაპრინტე "ბავშვი ხარ"
#  თუ ასაკი არის 13-19 მაშინ დაპრინტე "შენ ჯერ თინეიჯერი ხარ"
#  სხვა შემთხვევაში დაპრინტეთ "შენ ხარ ზრდასრული"
# age = int(input("please enter your age: "))
# if age  <= 12:
#     print("ბავშვი ხარ")
# elif age <= 19:
#     print("შენ თინეიჯერი ხარ")
# else:
#     print("ზრდასრული ხარ")


# For ციკლის მეშვეობით ტერმინალში გამოიტანეთ თქვენი საყვარელი საჭმელი 15ჯერ
# For ციკლის მეშვეობით ტერმინალში გამოიტანეთ 5-5ჯერ თქვენი ოჯახის წევრების სახელები
# for i in range(15):
#       print("xinkali")
# for i in range (5):
#     print("deda")


# დაწერე while loop, სადაც ცვლადი x იწყება 1-იდან და ყოველ ციკლში ორმაგდება, სანამ არ გადააჭარბებს 20-ს
# a = 1 
# while a < 20:
#     a = a*2
#     print(a)



# 1. რას შვება პრინტი? 
# 2. რა არის ცვლადი? 
# 3. ახსენი რა არის კომენტარი
# 4. ახსენი რა არის debugging
# 5. ახსენი რა არის snake_case
# 6. ახსენი რა არის input/output
# 7. ჩამოწერე და ახსენი ყველა მონაცემთა ტიპი 
# 8. რომელი ფუნქციებით შეგვიძლია მონაცემთა ტიპების შეცვლა
# 9. ახსენი ყველა ლოგიკური ოპერატორი
# 10. ჩამოწერე და ახსენი ყველა control flowს მაგალითი 
# 11. ახსენი ლუპები 
# 12. ახსენი if/elif/else 
# 13. ჩამოწერე ყველა ნასწავლი სტრინგის ფუნქცია და მიუწერე რას შვება 
# 14. ჩამოწერე ყველა ნასწავლი ლისტის ფუნქცია და მიუწერე რას შვება 
# 15. მომხმარებელს შემოატანინე სახელი, შემდეგ თუ ეს სახელი იწყება "რ"-ზე, მაშინ დაპრინტე "Hello", ხოლოსხვა შემთხვევაში დაპრინტე "Bye"
# 16.     მომხმარებელს შემოატანინე ასაკი და სახელი.
# თუ მომხმარებელის ასაკი ნაკლდებია 10ზე, დაპრინტე "პატარა ხარ, დაბრუნდი როცა 11ის გაცდები"
# თუ მომხმარებლის ასაკი მეტია ან ტოლი 10ზე და ნაკლებია 20ზე, ხოლო სახელი იწყება "ა"-ზე, დაპრინტე "გამარჯობა".
# თუ მომხმარებლის ასაკი მეტია ან ტოლი 10ზე და ნაკლებია 20ზე, ხოლო სახელი "ა"-ზე არ იწყება, დაპრინტე "Hello".
# თუ მომხმარებლის ასაკი მეტია ან ტოლი 20ზე და სახელის ბოლო ასო არის "ა", დაპრინტე "ნახვამდის"
# თუ მომხმარებლის ასაკი მეტია ან ტოლი 20ზე და სახელის ბოლო ასო არ არის "ა" დაპრინტე "Bye"
# 17. მომხმარებელს შემოატანინე რიცხვი და სახელი. შემდეგ დაპრინტე ეს სახელი, იმ რაოდენობით რაც არის შემოტანილი რიცხვი
# 18. მომხმარებელს შემოაყვანინე სახელი, შემდეგ თუ ამ სახელის, მესამე ასო არის 'გ' და ბოლო ასო არის 'ი' მაშინ დაპრინტე "Hello"
# ხოლო თუ სახელის მეორე ასო არის 'ბ' და ბოლოსწინა ასო არის 'ნ' დაპრინტე "Bye"
# სხვა შემთხვევაში დაპრინტე თავად შემოტანილი სახელი
# 19. Debugging
# name = int(input('Enter your name: '))

# if name(0) = 'გ'
#    print{Hello}
# elif:
#    print{Bye}
# 21. რა არის თეგი? 
# 22. რა არის ატრიბუტი? 
# 23. ჩამოწერე ყველა ნასწავლი თეგი 
# 24. რამდენი სახის css არსებობს? ჩამოწერე ყველა და მიუწერე რომელი როგორ მუშაობს 
# 25. რა არის id? რა განსხვავებაა idსა და class შორის? 
# 26. შექმენი ვებსაიტი საშაურმეზე. სადაც იქნება 2 გვერდი. პირველ გვერდზე იქნება რეგისტრაცია(სახელი, გვარი, ასაკი, მისამართი, ტელეფონის ნომერი, ბარათის ნომერი). ხოლო მეორეზე უშვალოდ ვებსაიტი. გამოიყენე css.



#1  პრინტს გამოაქვს ტერმინალში ნებისმიერი რაგაც
#2ცვლადი არის სახელით შენახული მნიშვნელობა
#3კომენტარი არის მაგალითად მუშაობ დიდ ვებსაიტზე კომენტარები იმაში გეხმარება რომ სხვებს გაგებინო ტუ რამე სჭირს კოდ მაგალიტად ხარვეზი
#ან რამე ეგეთი
#4 კოდის გასწორება იგი ასწორებს კოდში შეცდომებს
#5ცლადების წერის სტილი სადაც სიტყვები ქვედა ტირით იყოფა
#6 input- მომხმარებლისგან მონაცემების მღება
# output-შედეგის ეკრანზე გამოტანა
#7 integeri-მთელი რიცხვი
#stringi-ტექსტი
#boolean-True/False
#list-სია
#float-ათწილადბი
#8 int() float() str() bool()
#9 and- ერთ ერთი მაინც უნდა იყოს ფალსი რომ გამოვიდეს ფალსი
# or-ერთ ერთი მაინც ტრუ უნდა იყოს რომ გაომვიდეს ტრუ
# not-პირობას საწინააღმდეგოთ აბრუნებს მაგალითად not true იქნება ფალსი
#10 #for-ციკლი
#while-ციკლი
#11-ლუპი არის კოდის გამეორება რამდენიმეჯერ
#12 გოამიყენება პირობის მიხედვით სხვადასხვა კოდის შესასრულებლად
#13 capitalaize- იგი პირველ ასოს დიდს ხდის
#title-ყველა სიტყვის პირველი ასო დიდი
#lower-ყველა ასოს პატარად აქცევს
#upper-ყველა ასოს დიდად აქცევს
#14 #append-ამატებს ელემენტ ბოლოში
#insert-ამატებს ინდექს
#remove-შლის კონკრეტულ ელემენტს
#pop-შლის და აბრუნებს ბოლო ელემენტს
#clear-შლის მთელ სიას
#index-აბრუნებს ელემენტის ინდექს
#count-ითვლის რამდენჯერ არის გამოყეენული ელემენტი
#sort-ალაგებს ზრდიდ
#copy-აკოპირებს
#min-აჩვენებს უმცირეს ელემენტს
#max-აჩვენებს უდიდეს ელემენტს
#sorted-დალაგებული სიის დაბრუნება
#list-სიის შექმნა
#revers-აბრუნებს სიას
#len-ზომავს
#15
# name = input ("please enter your name:")
# if name[0]== "რ":
#     print("hello")
# else:
#     print("bye")
#16
# age = int(input("please enter your age"))
# if age <= 10:
#     print("პატარა ხარ დაბრუნდი როცა 11 იქნები")
# elif age >= 20:
#     print("სკოლელი ხარ")
# else:
#    print("სრდასრული ხარ") 
 #17 
# num = int(input("enter number"))
# name = input("enter name")
# for i in range(num):
#     print(name)
#18
# name = input("enter your name")
# if name[2] == "გ" and name[-1] == "ი":
#     print("hello")
# elif name[1] == "ბ" and name[-2] == "ნ":
#     print("bye")

#19
    



    
















