#flow sequesling-როდესაც მაგალითად პითონი მიყვება თანმიმდევრობას მაგალიტად print(name) name=lazare ასე ის ამოგვიგდებს რომ სახელი საერთოდ არ არის შექმნილი.
#iteration-როდესაც რაღაც არ ჩერდება სანამ ჩვენ არ შევაჩერებთ და მუდმივად მეორდება
#selection-როდესაც პითონს აქვს არჩევანი მაგალითად ავიღოტ 6>3 მან უნდა გამოიტანოს ან True ან False

#algoriTmi- არის როდესაც რაღაცა ისტრუქციას გვაძლევს რა უნდა გავაკეთოთ


#საიტერაცია ცვალადი არის რომლის შეცვლაც შეიძლება


#for i in range(10): 
    #print("lazare")

for i in range(20):
    print(12)